#+title: RASP Machines
#+subtitle: Computation Model to Better Compare Algorithms
#+author: Franck Chauvel
#+date: May 22, 2021
#+language: en


#+SETUPFILE: ../templates/style.org


* Comparing Programs

  Let's start with an example, two programs that both compute the sum
  of even integer until 100. The first program I wrote in C and the
  second in Python.

  #+caption: C program to compute the sum of even integers (until 100), using a loop.
  #+name: with_a_loop 
  #+begin_src C -n :results output :cache yes :exports both :tangle experiments/sum.c
    #include <stdio.h>

    #define LIMIT 100

    int main(int argvc, char** argv) {
      int sum = 0; 
      for (int any_integer=0; any_integer <= LIMIT ; any_integer++) {
        if (any_integer % 2 == 0) {
          sum += any_integer;
        }
      }
      printf("Total: %d\n", sum);
    }
   #+end_src

   #+RESULTS[f7cc5876da7d322b0375a75c6dc9681f44515658]: with_a_loop
   : Total: 2550

   I chose to write the second program in Python. This one does not
   use a loop but a formula to compute the sum of even integer, namely
   $\sum_{i=1}^{n} i = \frac{n\cdot(n+1)}{2}$.

   #+name: with_a_formula
   #+caption: A alternative Python program to compute the sum of even integers until 100
   #+begin_src python :python python3 :results output :exports both :cache yes :tangle experiments/sum.py
     LIMIT = 100

     half = LIMIT / 2
     total = half * (half + 1)
     print(f"Total: {total}")
   #+end_src

   #+RESULTS[58ae01dfd2d65c91ce40f7f2c98b37e6e947f530]: with_a_formula
   : Total: 2550.0

   #+begin_note
   Where does this formula come from? Well, let's work out the
   math. If we take the sum $s$ of even integers, we get $s = 2 + 4 +
   6 + \ldots + n$ where n is the our limit (i.e., 100).  By
   definition we can factor out 2, because each integer is even, and
   so we get $s = 2 \cdot (1 + 2 + 3 + \ldots + n/2)$. We can further
   simplify the second term because there is a formula $\sum_{i=1}^{n}
   i = \frac{n\cdot(n+1)}{2}$. So we get $s = 2 \times
   \sum_{i=1}^{n/2} i$
   #+end_note
   
   
** Measuring Execution Time

   So which one is best? Difficult to say from the outset. The first
   program includes a loop, but it runs in C, which compiles to native
   code. Let see what we get if we where to measure.

   #+begin_warning
   Note that measuring the time a program takes to run (or the memory
   it consume) is known as /performance testing/, and is a complex
   task. What we do below is naive and none would proceed this way.
   #+end_warning
   
   #+caption: Timing our C-program
   #+name: timing_c_program
   #+begin_src shell :results output :cache yes :exports both :dir ./experiments :prologue exec 2>&1
     gcc sum.c
     time ./a.out
   #+end_src

   #+RESULTS[f2778347ff383df2dbae9aef3409d1ecdd69c174]: timing_c_program
   : Total: 2550
   : ./a.out  0.00s user 0.00s system 2% cpu 0.189 total

   On my laptop that about 195 ms to run as show the output above.

   Let's move on to our second program written in Python. Here we can
   measure the time it takes in a similar way.

   #+name: timing_python
   #+caption: Timing our Python program
   #+begin_src shell :results output :cache yes :exports both :dir ./experiments :prologue exec 2>&1
     time python3 sum.py
   #+end_src

   #+results: timing_python
   : Total: 2550.0
   : python3 sum.py  0.02s user 0.01s system 93% cpu 0.022 total

   This one takes about 23 ms to run. It seems this one is definitely
   faster.

   But could it be that the first program is faster, simply because it
   is compiled to machine code whereas the second one is interpreted?
   To make a fair comparison, we must abstract away the underlying
   compiler (or interpreter) and hardware. To do this, we will use /an
   abstract machine/, the RAM.  
  
